In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
dataset = pd.read_csv("All_Brand_Cars_price_in_Pakistan.csv")
dataset.head()

       Make     Model  Year  Min Price  Max Price
0       BMW  7 Series  2008  5,500,000  5,500,000
1    Daewoo     Racer  1993    335,000    335,000
2  Daihatsu   Charade  1984    325,000    325,000
3  Daihatsu   Charade  1993    235,000    235,000
4  Daihatsu     Cuore  2004    450,000    450,000

In [5]:
dataset.isnull().sum()

Make         0
Model        0
Year         0
Min Price    0
Max Price    0
dtype: int64

In [6]:
dataset.isna().sum()

Make         0
Model        0
Year         0
Min Price    0
Max Price    0
dtype: int64

In [9]:
dataset["Model"].unique()

array(['7 Series', 'Racer', 'Charade', 'Cuore', 'Cuore CX', 'Mira',
       'Move', 'Accord', 'City', 'City Aspire', 'City IDSI', 'City IVTEC',
       'City Vario', 'Civic', 'Civic EXi', 'Civic IVTEC',
       'Civic Prosmetic', 'Civic VTi', 'Civic VTi Oriel',
       'Civic VTi Oriel Prosmatec', 'Civic VTi Prosmatec', 'CR Z',
       'CR Z Sports Hybird', 'Fit', 'Insight', 'Life', 'Vezel',
       'Santro Club', 'Sportage', 'Range Rover Sport', 'CT 200h',
       'CT 450h', 'Harrier', 'RX 400h', 'RX 450h', 'Quattroporte',
       'Az Wagon', 'RX8', 'Scrum', 'C Class', 'E Class', 'S Class', 'GTO',
       'Lancer', 'Minicab', 'Pajero Mini', '350Z', 'Juke', 'Latio', 'NX',
       'Sunny', 'Boxster', 'Alto', 'APV', 'Bolan', 'Bolan VX', 'Cultus',
       'Cultus VX', 'Cultus VXL', 'Cultus VXR', 'Every', 'Khyber',
       'Liana', 'Margalla', 'Mehran', 'Mehran VX', 'Mehran VXR', 'Swift',
       'Wagon R', 'Allion', 'Aqua', 'Belta', 'Camry', 'Corolla',
       'Corolla 2.0 D Saloon', 'Corolla Altis', 'Corolla Axio',
       'Corolla Gli', 'Corolla Saloon', 'Corolla XE', 'Corolla Xli',
       'Crown Athlete', 'Estima', 'Fielder X', 'Hilux', 'Hilux Vigo',
       'iQ', 'Land Cruiser', 'Land Cruiser Prado', 'Mark X', 'Passo',
       'Prado', 'Premio', 'Prius', 'Supra', 'Townace', 'Tundra', 'Vitz',
       'Wish', 'Foxy', 'Golf GTI', 'Up'], dtype=object)

Generating Dummie Data

In [13]:
from sklearn.preprocessing import LabelEncoder

# Encoding data
le = LabelEncoder()
dataset['Model'] = le.fit_transform(["Model"])

array([0])

In [15]:
dataset.head()

       Make     Model  Year  Min Price  Max Price
0       BMW  7 Series  2008  5,500,000  5,500,000
1    Daewoo     Racer  1993    335,000    335,000
2  Daihatsu   Charade  1984    325,000    325,000
3  Daihatsu   Charade  1993    235,000    235,000
4  Daihatsu     Cuore  2004    450,000    450,000

### Visualisation